bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_glb.h
/**
  ******************************************************************************
  * @file    bl702l_glb.h
  * @version V1.0
  * @date
  * @brief   This file is the standard driver header file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __BL702L_GLB_H__
#define __BL702L_GLB_H__

#include "glb_reg.h"
#include "pds_reg.h"
#include "bl702l_glb_gpio.h"
#include "bl702l_gpio.h"
#include "bl702l_l1c.h"
#include "bl702l_hbn.h"
#include "bl702l_aon.h"
#include "bl702l_ef_cfg.h"
#include "bl702l_pds.h"
#include "bl702l_common.h"
#include "bflb_sf_ctrl.h"
#include "bflb_sf_cfg.h"

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup  BL702L_Peripheral_Driver
 *  @{
 */

/** @addtogroup  GLB
 *  @{
 */

/** @defgroup  GLB_Public_Types
 *  @{
 */

/**
 *  @brief GLB IR_LED type definition
 */
enum {
    GLB_IR_LED0, /*!< IR_LED0 */
    GLB_IR_LED1, /*!< IR_LED1 */
};
typedef BL_ENUM_Type GLB_IR_LED_Type;

/**
 *  @brief GLB root clock type definition
 */
enum {
    GLB_ROOT_CLK_RC32M, /*!< root clock select RC32M */
    GLB_ROOT_CLK_XTAL,  /*!< root clock select XTAL */
    GLB_ROOT_CLK_DLL,   /*!< root clock select DLL others */
};
typedef BL_ENUM_Type GLB_ROOT_CLK_Type;

/**
 *  @brief GLB system clock type definition
 */
enum {
    GLB_SYS_CLK_RC32M,     /*!< use RC32M as system clock frequency */
    GLB_SYS_CLK_XTAL,      /*!< use XTAL as system clock */
    GLB_SYS_CLK_DLL25P6M,  /*!< use DLL output 25.6MHz as system clock */
    GLB_SYS_CLK_DLL42P67M, /*!< use DLL output 42.67MHz as system clock */
    GLB_SYS_CLK_DLL64M,    /*!< use DLL output 64MHz as system clock */
    GLB_SYS_CLK_DLL128M,   /*!< use DLL output 128MHz as system clock */
};
typedef BL_ENUM_Type GLB_SYS_CLK_Type;

/**
 *  @brief GLB AUDIO clock source type definition
 */
enum {
    GLB_AUDIO_CLK_SRC_2P032M, /*!< Select 2.032MHz as AUDIO clock source */
    GLB_AUDIO_CLK_SRC_6P095M, /*!< Select 6.095MHz as AUDIO clock source */
};
typedef BL_ENUM_Type GLB_AUDIO_CLK_SRC_Type;

/**
 *  @brief GLB KYS clock source type definition
 */
enum {
    GLB_KYS_CLK_SRC_XCLK, /*!< KYS clock source select XCLK */
    GLB_KYS_CLK_SRC_F32K, /*!< KYS clock source select f32k */
};
typedef BL_ENUM_Type GLB_KYS_CLK_SRC_Type;

/**
 *  @brief GLB DMA clock ID type definition
 */
enum {
    GLB_DMA_CLK_DMA0_CH0, /*!< DMA clock ID:channel 0 */
    GLB_DMA_CLK_DMA0_CH1, /*!< DMA clock ID:channel 1 */
    GLB_DMA_CLK_DMA0_CH2, /*!< DMA clock ID:channel 2 */
    GLB_DMA_CLK_DMA0_CH3, /*!< DMA clock ID:channel 3 */
};
typedef BL_ENUM_Type GLB_DMA_CLK_ID_Type;

/**
 *  @brief GLB IR clock source type definition
 */
enum {
    GLB_IR_CLK_SRC_XCLK, /*!< IR clock source select XCLK */
};
typedef BL_ENUM_Type GLB_IR_CLK_SRC_Type;

/**
 *  @brief GLB flash clock type definition
 */
enum {
    GLB_SFLASH_CLK_XCLK,   /*!< Select XCLK as flash clock */
    GLB_SFLASH_CLK_64M,    /*!< Select 64M as flash clock */
    GLB_SFLASH_CLK_BCLK,   /*!< Select BCLK as flash clock */
    GLB_SFLASH_CLK_42P67M, /*!< Select 42.67M as flash clock */
};
typedef BL_ENUM_Type GLB_SFLASH_CLK_Type;

/**
 *  @brief GLB chip clock out 0 type definition
 */
enum {
    GLB_CHIP_CLK_OUT_0_NONE,   /*!< no chip clock out */
    GLB_CHIP_CLK_OUT_0_2P032M, /*!< DLL div63 2.032MHz clock out */
    GLB_CHIP_CLK_OUT_0_6P095M, /*!< DLL div21 6.095MHz clock out */
    GLB_CHIP_CLK_OUT_0_XCLK,   /*!< clk_xclk */
};
typedef BL_ENUM_Type GLB_CHIP_CLK_OUT_0_Type;

/**
 *  @brief GLB chip clock out 1 type definition
 */
enum {
    GLB_CHIP_CLK_OUT_1_NONE,     /*!< no chip clock out */
    GLB_CHIP_CLK_OUT_1_F32K,     /*!< f32k clock out */
    GLB_CHIP_CLK_OUT_1_ANA_XTAL, /*!< ana xtal clock out */
    GLB_CHIP_CLK_OUT_1_DIG_XTAL, /*!< dig xtal clock out */
};
typedef BL_ENUM_Type GLB_CHIP_CLK_OUT_1_Type;

/**
 *  @brief GLB I2C clock source type definition
 */
enum {
    GLB_I2C_CLK_SRC_BCLK, /*!< I2C clock source select BCLK */
    GLB_I2C_CLK_SRC_XCLK, /*!< I2C clock source select XCLK */
};
typedef BL_ENUM_Type GLB_I2C_CLK_SRC_Type;

/**
 *  @brief GLB SPI clock source type definition
 */
enum {
    GLB_SPI_CLK_SRC_BCLK, /*!< SPI clock source select BCLK */
    GLB_SPI_CLK_SRC_XCLK, /*!< SPI clock source select XCLK */
};
typedef BL_ENUM_Type GLB_SPI_CLK_SRC_Type;

/**
 *  @brief GLB SPI pad action type definition
 */
enum {
    GLB_SPI_PAD_ACT_AS_SLAVE,  /*!< SPI pad act as slave */
    GLB_SPI_PAD_ACT_AS_MASTER, /*!< SPI pad act as master */
};
typedef BL_ENUM_Type GLB_SPI_PAD_ACT_AS_Type;

/**
 *  @brief GLB PKA clock source type definition
 */
enum {
    GLB_PKA_CLK_SRC_HCLK,      /*!< PKA clock source select HCLK */
    GLB_PKA_CLK_SRC_DLL128M,   /*!< PKA clock source select DLL128M */
    GLB_PKA_CLK_SRC_DLL64M,    /*!< PKA clock source select DLL64M */
    GLB_PKA_CLK_SRC_DLL42P67M, /*!< PKA clock source select DLL42.67M */
};
typedef BL_ENUM_Type GLB_PKA_CLK_SRC_Type;

/**
 *  @brief BMX arb mode type definition
 */
enum {
    BMX_ARB_FIX,         /*!< 0->fix */
    BMX_ARB_ROUND_ROBIN, /*!< 2->round-robin */
    BMX_ARB_RANDOM,      /*!< 3->random */
};
typedef BL_ENUM_Type BMX_ARB_Type;

/**
 *  @brief GLB AHB software type definition
 */
enum {
    GLB_AHB_MCU_SW_M154 = 4,
    GLB_AHB_MCU_SW_BLE = 8,
    GLB_AHB_MCU_SW_GLB = 32,
    GLB_AHB_MCU_SW_MIX = 33,
    GLB_AHB_MCU_SW_GPIP = 34,
    GLB_AHB_MCU_SW_SEC_DBG = 35,
    GLB_AHB_MCU_SW_SEC_ENG = 36,
    GLB_AHB_MCU_SW_TZ1 = 37,
    GLB_AHB_MCU_SW_TZ2 = 38,
    GLB_AHB_MCU_SW_EFUSE = 39,
    GLB_AHB_MCU_SW_CCI = 40,
    GLB_AHB_MCU_SW_L1C = 41,
    GLB_AHB_MCU_SW_SF = 43,
    GLB_AHB_MCU_SW_DMA = 44,
    GLB_AHB_MCU_SW_PDS = 46,
    GLB_AHB_MCU_SW_UART0 = 48,
    GLB_AHB_MCU_SW_SPI = 50,
    GLB_AHB_MCU_SW_I2C = 51,
    GLB_AHB_MCU_SW_PWM = 52,
    GLB_AHB_MCU_SW_TIMER = 53,
    GLB_AHB_MCU_SW_IR_REMOTE = 54,
    GLB_AHB_MCU_SW_CHECKSUM = 55,
    GLB_AHB_MCU_SW_KYS = 57,
    GLB_AHB_MCU_SW_AUSOLO = 61,
    GLB_AHB_MCU_SW_PWRON_RST = 64,
    GLB_AHB_MCU_SW_CPU_RESET = 65,
    GLB_AHB_MCU_SW_SYS_RESET = 66,
};
