bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_glb.h
typedef BL_ENUM_Type GLB_AHB_MCU_SW_Type;

/**
 *  @brief GLB dis reset type definition
 */
enum {
    GLB_DISRST_MIX = 1,
    GLB_DISRST_GPIP = 2,
    GLB_DISRST_CCI = 8,
    GLB_DISRST_SF = 11,
    GLB_DISRST_DMA = 12,
    GLB_DISRST_UART0 = 16,
    GLB_DISRST_SPI = 18,
    GLB_DISRST_I2C = 19,
    GLB_DISRST_PWM = 20,
    GLB_DISRST_TIMER = 21,
    GLB_DISRST_IR_REMOTE = 22,
    GLB_DISRST_CHECKSUM = 23,
    GLB_DISRST_KYS = 25,
    GLB_DISRST_AUSOLO = 29,
};
typedef BL_ENUM_Type GLB_DISRST_Type;

/**
 *  @brief BMX configuration structure type definition
 */
typedef struct {
    uint8_t timeoutEn;   /*!< Bus timeout enable: detect slave no reaponse in 1024 cycles */
    BL_Fun_Type errEn;   /*!< Bus error response enable */
    BMX_ARB_Type arbMod; /*!< 0->fix, 2->round-robin, 3->random */
} BMX_Cfg_Type;

/**
 *  @brief RTC mode type definition
 */
enum {
    RTC_MODE_LOWPOWER, /*!< RTC work on low power mode */
    RTC_MODE_NORMAL,   /*!< RTC work on normal mode */
};
typedef BL_ENUM_Type RTC_MODE_Type;

/**
 *  @brief BMX bus err type definition
 */
enum {
    BMX_BUS_ERR_TRUSTZONE_DECODE, /*!< Bus trustzone decode error */
    BMX_BUS_ERR_ADDR_DECODE,      /*!< Bus addr decode error */
};
typedef BL_ENUM_Type BMX_BUS_ERR_Type;

/**
 *  @brief BMX bus err interrupt type definition
 */
enum {
    BMX_ERR_INT_ERR, /*!< BMX bus err interrupt */
    BMX_ERR_INT_ALL, /*!< BMX bus err interrupt max num */
};
typedef BL_ENUM_Type BMX_ERR_INT_Type;

/**
 *  @brief BMX time out interrupt type definition
 */
enum {
    BMX_TO_INT_TIMEOUT, /*!< BMX timeout interrupt */
    BMX_TO_INT_ALL,     /*!< BMX timeout interrupt max num */
};
typedef BL_ENUM_Type BMX_TO_INT_Type;

/**
 *  @brief GLB EM type definition
 */
enum {
    GLB_EM_0KB = 0x0,  /*!< 0x0 --> 0KB */
    GLB_EM_8KB = 0x3,  /*!< 0x3 --> 8KB */
    GLB_EM_16KB = 0xF, /*!< 0xF --> 16KB */
};
typedef BL_ENUM_Type GLB_EM_Type;

/**
 *  @brief GLB MTIMER clock type definition
 */
enum {
    GLB_MTIMER_CLK_XCLK, /*!< BUS clock */
    GLB_MTIMER_CLK_F32K, /*!< 32KHz */
};
typedef BL_ENUM_Type GLB_MTIMER_CLK_Type;

/**
 *  @brief GLB ADC clock source type definition
 */
enum {
    GLB_ADC_CLK_SRC_F32K, /*!< ADC clock source select F32K */
    GLB_ADC_CLK_SRC_XCLK, /*!< ADC clock source select XCLK */
};
typedef BL_ENUM_Type GLB_ADC_CLK_SRC_Type;

/**
 *  @brief GLB DIG clock source select type definition
 */
enum {
    GLB_DIG_CLK_SRC_XTAL32M, /*!< select XTAL32M as DIG clock source */
    GLB_DIG_CLK_SRC_RC32M,   /*!< select RC32M as DIG clock source */
};
typedef BL_ENUM_Type GLB_DIG_CLK_SRC_Type;

/**
 *  @brief GLB BT bandwidth type definition
 */
enum {
    GLB_BT_BANDWIDTH_1M, /*!< BT bandwidth 1MHz */
    GLB_BT_BANDWIDTH_2M, /*!< BT bandwidth 2MHz */
};
typedef BL_ENUM_Type GLB_BT_BANDWIDTH_Type;

/**
 *  @brief GLB UART signal type definition
 */
enum {
    GLB_UART_SIG_0, /*!< UART signal 0 */
    GLB_UART_SIG_1, /*!< UART signal 1 */
    GLB_UART_SIG_2, /*!< UART signal 2 */
    GLB_UART_SIG_3, /*!< UART signal 3 */
};
typedef BL_ENUM_Type GLB_UART_SIG_Type;

/**
 *  @brief GLB UART signal  function type definition
 */
enum {
    GLB_UART_SIG_FUN_UART0_RTS, /*!< UART funtion: UART 0 RTS */
    GLB_UART_SIG_FUN_UART0_CTS, /*!< UART funtion: UART 0 CTS */
    GLB_UART_SIG_FUN_UART0_TXD, /*!< UART funtion: UART 0 TXD */
    GLB_UART_SIG_FUN_UART0_RXD, /*!< UART funtion: UART 0 RXD */
};
typedef BL_ENUM_Type GLB_UART_SIG_FUN_Type;

/**
 *  @brief GLB DLL output clock type definition
 */
enum {
    GLB_DLL_CLK_RF,     /*!< DLL output div1 RF clock */
    GLB_DLL_CLK_2P032M, /*!< DLL output 2.032MHz clock */
    GLB_DLL_CLK_6P095M, /*!< DLL output 6.095MHz clock */
    GLB_DLL_CLK_25P6M,  /*!< DLL output 25.6MHz clock */
    GLB_DLL_CLK_42P67M, /*!< DLL output 42.67MHz clock */
    GLB_DLL_CLK_64M,    /*!< DLL output 64MHz clock */
    GLB_DLL_CLK_128M,   /*!< DLL output 128MHz clock */
};
typedef BL_ENUM_Type GLB_DLL_CLK_Type;

/**
 *  @brief PLL XTAL type definition
 */
enum {
    GLB_DLL_XTAL_NONE,  /*!< XTAL is none */
    GLB_DLL_XTAL_32M,   /*!< XTAL is 32M */
    GLB_DLL_XTAL_RC32M, /*!< XTAL is RC32M */
};
typedef BL_ENUM_Type GLB_DLL_XTAL_Type;

/**
 *  @brief GLB AHB clock IP type definition
 */
enum {
    GLB_AHB_CLOCK_IP_CPU,
    GLB_AHB_CLOCK_IP_SDU,
    GLB_AHB_CLOCK_IP_SEC,
    GLB_AHB_CLOCK_IP_DMA_0,
    GLB_AHB_CLOCK_IP_DMA_1,
    GLB_AHB_CLOCK_IP_DMA_2,
    GLB_AHB_CLOCK_IP_CCI,
    GLB_AHB_CLOCK_IP_RF_TOP,
    GLB_AHB_CLOCK_IP_GPIP,
    GLB_AHB_CLOCK_IP_TZC,
    GLB_AHB_CLOCK_IP_EF_CTRL,
    GLB_AHB_CLOCK_IP_SF_CTRL,
    GLB_AHB_CLOCK_IP_EMAC,
    GLB_AHB_CLOCK_IP_UART0,
    GLB_AHB_CLOCK_IP_UART1,
    GLB_AHB_CLOCK_IP_UART2,
    GLB_AHB_CLOCK_IP_UART3,
    GLB_AHB_CLOCK_IP_UART4,
    GLB_AHB_CLOCK_IP_SPI,
    GLB_AHB_CLOCK_IP_I2C,
    GLB_AHB_CLOCK_IP_PWM,
    GLB_AHB_CLOCK_IP_TIMER,
    GLB_AHB_CLOCK_IP_IR,
    GLB_AHB_CLOCK_IP_CHECKSUM,
    GLB_AHB_CLOCK_IP_QDEC,
    GLB_AHB_CLOCK_IP_KYS,
    GLB_AHB_CLOCK_IP_I2S,
    GLB_AHB_CLOCK_IP_USB11,
    GLB_AHB_CLOCK_IP_CAM,
    GLB_AHB_CLOCK_IP_MJPEG,
    GLB_AHB_CLOCK_IP_BT_BLE_NORMAL,
    GLB_AHB_CLOCK_IP_BT_BLE_LP,
    GLB_AHB_CLOCK_IP_ZB_NORMAL,
    GLB_AHB_CLOCK_IP_ZB_LP,
    GLB_AHB_CLOCK_IP_WIFI_NORMAL,
    GLB_AHB_CLOCK_IP_WIFI_LP,
    GLB_AHB_CLOCK_IP_BT_BLE_2_NORMAL,
    GLB_AHB_CLOCK_IP_BT_BLE_2_LP,
    GLB_AHB_CLOCK_IP_EMI_MISC,
    GLB_AHB_CLOCK_IP_PSRAM0_CTRL,
    GLB_AHB_CLOCK_IP_PSRAM1_CTRL,
    GLB_AHB_CLOCK_IP_USB20_SDU,
    GLB_AHB_CLOCK_IP_MIX2,
    GLB_AHB_CLOCK_IP_AUDIO,
    GLB_AHB_CLOCK_IP_SDH,
    GLB_AHB_CLOCK_IP_ZB2_NORMAL,
    GLB_AHB_CLOCK_IP_ZB2_LP,
    GLB_AHB_CLOCK_IP_I2C1,
    GLB_AHB_CLOCK_IP_WIFI_PHY,
    GLB_AHB_CLOCK_IP_WIFI_MAC_PHY,
    GLB_AHB_CLOCK_IP_WIFI_PLATFORM,
    GLB_AHB_CLOCK_IP_LZ4,
    GLB_AHB_CLOCK_IP_AUPDM,
    GLB_AHB_CLOCK_IP_GAUGE,
    GLB_AHB_CLOCK_IP_DBI,
    GLB_AHB_CLOCK_IP_AUSOLO_TOP,
    GLB_AHB_CLOCK_IP_DMA_GPIO,
    GLB_AHB_CLOCK_IP_MM_MISC,
};
typedef BL_ENUM_Type GLB_AHB_CLOCK_IP_Type;

/*@} end of group GLB_Public_Types */

