bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_glb.h
/** @defgroup  GLB_Public_Constants
 *  @{
 */

/** @defgroup  GLB_ROOT_CLK_TYPE
 *  @{
 */
#define IS_GLB_IR_LED_TYPE(type) (((type) == GLB_IR_LED0) || \
                                  ((type) == GLB_IR_LED1))

/** @defgroup  GLB_ROOT_CLK_TYPE
 *  @{
 */
#define IS_GLB_ROOT_CLK_TYPE(type) (((type) == GLB_ROOT_CLK_RC32M) || \
                                    ((type) == GLB_ROOT_CLK_XTAL) ||  \
                                    ((type) == GLB_ROOT_CLK_DLL))

/** @defgroup  GLB_SYS_CLK_TYPE
 *  @{
 */
#define IS_GLB_SYS_CLK_TYPE(type) (((type) == GLB_SYS_CLK_RC32M) ||     \
                                   ((type) == GLB_SYS_CLK_XTAL) ||      \
                                   ((type) == GLB_SYS_CLK_DLL25P6M) ||  \
                                   ((type) == GLB_SYS_CLK_DLL42P67M) || \
                                   ((type) == GLB_SYS_CLK_DLL64M) ||    \
                                   ((type) == GLB_SYS_CLK_DLL128M))

/** @defgroup  GLB_AUDIO_CLK_SRC_TYPE
 *  @{
 */
#define IS_GLB_AUDIO_CLK_SRC_TYPE(type) (((type) == GLB_AUDIO_CLK_SRC_2P032M) || \
                                         ((type) == GLB_AUDIO_CLK_SRC_6P095M))

/** @defgroup  GLB_KYS_CLK_SRC_TYPE
 *  @{
 */
#define IS_GLB_KYS_CLK_SRC_TYPE(type) (((type) == GLB_KYS_CLK_SRC_XCLK) || \
                                       ((type) == GLB_KYS_CLK_SRC_F32K))

/** @defgroup  GLB_DMA_CLK_ID_TYPE
 *  @{
 */
#define IS_GLB_DMA_CLK_ID_TYPE(type) (((type) == GLB_DMA_CLK_DMA0_CH0) || \
                                      ((type) == GLB_DMA_CLK_DMA0_CH1) || \
                                      ((type) == GLB_DMA_CLK_DMA0_CH2) || \
                                      ((type) == GLB_DMA_CLK_DMA0_CH3))

/** @defgroup  GLB_IR_CLK_SRC_TYPE
 *  @{
 */
#define IS_GLB_IR_CLK_SRC_TYPE(type) (((type) == GLB_IR_CLK_SRC_XCLK))

/** @defgroup  GLB_I2C_CLK_SRC_TYPE
 *  @{
 */
#define IS_GLB_I2C_CLK_SRC_TYPE(type) (((type) == GLB_I2C_CLK_SRC_BCLK) || \
                                       ((type) == GLB_I2C_CLK_SRC_XCLK))

/** @defgroup  GLB_SPI_CLK_SRC_TYPE
 *  @{
 */
#define IS_GLB_SPI_CLK_SRC_TYPE(type) (((type) == GLB_SPI_CLK_SRC_BCLK) || \
                                       ((type) == GLB_SPI_CLK_SRC_XCLK))

/** @defgroup  GLB_SFLASH_CLK_TYPE
 *  @{
 */
#define IS_GLB_SFLASH_CLK_TYPE(type) (((type) == GLB_SFLASH_CLK_XCLK) || \
                                      ((type) == GLB_SFLASH_CLK_64M) ||  \
                                      ((type) == GLB_SFLASH_CLK_BCLK) || \
                                      ((type) == GLB_SFLASH_CLK_42P67M))

/** @defgroup  GLB_CHIP_CLK_OUT_1_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_OUT_1_TYPE(type) (((type) == GLB_CHIP_CLK_OUT_1_NONE) ||     \
                                          ((type) == GLB_CHIP_CLK_OUT_1_F32K) ||     \
                                          ((type) == GLB_CHIP_CLK_OUT_1_ANA_XTAL) || \
                                          ((type) == GLB_CHIP_CLK_OUT_1_DIG_XTAL))

/** @defgroup  GLB_CHIP_CLK_OUT_0_TYPE
 *  @{
 */
#define IS_GLB_CHIP_CLK_OUT_0_TYPE(type) (((type) == GLB_CHIP_CLK_OUT_0_NONE) ||   \
                                          ((type) == GLB_CHIP_CLK_OUT_0_2P032M) || \
                                          ((type) == GLB_CHIP_CLK_OUT_0_6P095M) || \
                                          ((type) == GLB_CHIP_CLK_OUT_0_XCLK))

/** @defgroup  GLB_SPI_PAD_ACT_AS_TYPE
 *  @{
 */
#define IS_GLB_SPI_PAD_ACT_AS_TYPE(type) (((type) == GLB_SPI_PAD_ACT_AS_SLAVE) || \
                                          ((type) == GLB_SPI_PAD_ACT_AS_MASTER))

/** @defgroup  GLB_PKA_CLK_TYPE
 *  @{
 */
#define IS_GLB_PKA_CLK_SRC_TYPE(type) (((type) == GLB_PKA_CLK_SRC_HCLK) ||    \
                                       ((type) == GLB_PKA_CLK_SRC_DLL128M) || \
                                       ((type) == GLB_PKA_CLK_SRC_DLL64M) ||  \
                                       ((type) == GLB_PKA_CLK_SRC_DLL42P67M))

/** @defgroup  GLB_AHB_SW_TYPE
 *  @{
 */
#define IS_GLB_AHB_MCU_SW_TYPE(type) (((type) == GLB_AHB_MCU_SW_M154) ||      \
                                      ((type) == GLB_AHB_MCU_SW_BLE) ||       \
                                      ((type) == GLB_AHB_MCU_SW_GLB) ||       \
                                      ((type) == GLB_AHB_MCU_SW_MIX) ||       \
                                      ((type) == GLB_AHB_MCU_SW_GPIP) ||      \
                                      ((type) == GLB_AHB_MCU_SW_SEC_DBG) ||   \
                                      ((type) == GLB_AHB_MCU_SW_SEC_ENG) ||   \
                                      ((type) == GLB_AHB_MCU_SW_TZ1) ||       \
                                      ((type) == GLB_AHB_MCU_SW_TZ2) ||       \
                                      ((type) == GLB_AHB_MCU_SW_EFUSE) ||     \
                                      ((type) == GLB_AHB_MCU_SW_CCI) ||       \
                                      ((type) == GLB_AHB_MCU_SW_L1C) ||       \
                                      ((type) == GLB_AHB_MCU_SW_SF) ||        \
                                      ((type) == GLB_AHB_MCU_SW_DMA) ||       \
                                      ((type) == GLB_AHB_MCU_SW_PDS) ||       \
                                      ((type) == GLB_AHB_MCU_SW_UART0) ||     \
                                      ((type) == GLB_AHB_MCU_SW_SPI) ||       \
                                      ((type) == GLB_AHB_MCU_SW_I2C) ||       \
                                      ((type) == GLB_AHB_MCU_SW_PWM) ||       \
                                      ((type) == GLB_AHB_MCU_SW_TIMER) ||     \
                                      ((type) == GLB_AHB_MCU_SW_IR_REMOTE) || \
                                      ((type) == GLB_AHB_MCU_SW_CHECKSUM) ||  \
                                      ((type) == GLB_AHB_MCU_SW_KYS) ||       \
                                      ((type) == GLB_AHB_MCU_SW_AUSOLO) ||    \
                                      ((type) == GLB_AHB_MCU_SW_PWRON_RST) || \
                                      ((type) == GLB_AHB_MCU_SW_CPU_RESET) || \
                                      ((type) == GLB_AHB_MCU_SW_SYS_RESET))

/** @defgroup  GLB DISRST_TYPE
 *  @{
 */
#define IS_GLB_DISRST_TYPE(type) (((type) == GLB_DISRST_MIX) ||       \
                                  ((type) == GLB_DISRST_GPIP) ||      \
                                  ((type) == GLB_DISRST_CCI) ||       \
                                  ((type) == GLB_DISRST_SF) ||        \
                                  ((type) == GLB_DISRST_DMA) ||       \
                                  ((type) == GLB_DISRST_UART0) ||     \
                                  ((type) == GLB_DISRST_SPI) ||       \
                                  ((type) == GLB_DISRST_I2C) ||       \
                                  ((type) == GLB_DISRST_PWM) ||       \
                                  ((type) == GLB_DISRST_TIMER) ||     \
                                  ((type) == GLB_DISRST_IR_REMOTE) || \
                                  ((type) == GLB_DISRST_CHECKSUM) ||  \
                                  ((type) == GLB_DISRST_KYS) ||       \
                                  ((type) == GLB_DISRST_AUSOLO))

/** @defgroup  RTC_MODE_TYPE
 *  @{
 */
#define IS_RTC_MODE_TYPE(type) (((type) == RTC_MODE_LOWPOWER) || \
                                ((type) == RTC_MODE_NORMAL))

/** @defgroup  BMX_ARB_TYPE
 *  @{
 */
#define IS_BMX_ARB_TYPE(type) (((type) == BMX_ARB_FIX) ||         \
                               ((type) == BMX_ARB_ROUND_ROBIN) || \
                               ((type) == BMX_ARB_RANDOM))

/** @defgroup  BMX_BUS_ERR_TYPE
 *  @{
 */
#define IS_BMX_BUS_ERR_TYPE(type) (((type) == BMX_BUS_ERR_TRUSTZONE_DECODE) || \
                                   ((type) == BMX_BUS_ERR_ADDR_DECODE))

/** @defgroup  BMX_ERR_INT_TYPE
 *  @{
 */
#define IS_BMX_ERR_INT_TYPE(type) (((type) == BMX_ERR_INT_ERR) || \
                                   ((type) == BMX_ERR_INT_ALL))

/** @defgroup  BMX_TO_INT_TYPE
 *  @{
 */
#define IS_BMX_TO_INT_TYPE(type) (((type) == BMX_TO_INT_TIMEOUT) || \
                                  ((type) == BMX_TO_INT_ALL))

