bouffalolab/bouffalo_sdk/drivers/soc/bl702l/std/include/bl702l_glb.h
/** @defgroup  GLB_EM_TYPE
 *  @{
 */
#define IS_GLB_EM_TYPE(type) (((type) == GLB_EM_0KB) || \
                              ((type) == GLB_EM_8KB) || \
                              ((type) == GLB_EM_16KB))

/** @defgroup  GLB_MTIMER_CLK_TYPE
 *  @{
 */
#define IS_GLB_MTIMER_CLK_TYPE(type) (((type) == GLB_MTIMER_CLK_XCLK) || \
                                      ((type) == GLB_MTIMER_CLK_F32K))

/** @defgroup  GLB_ADC_CLK_TYPE
 *  @{
 */
#define IS_GLB_ADC_CLK_SRC_TYPE(type) (((type) == GLB_ADC_CLK_SRC_F32K) || \
                                       ((type) == GLB_ADC_CLK_SRC_XCLK))

/** @defgroup  GLB_DIG_CLK_TYPE
 *  @{
 */
#define IS_GLB_DIG_CLK_SRC_TYPE(type) (((type) == GLB_DIG_CLK_SRC_XTAL32M) || \
                                       ((type) == GLB_DIG_CLK_SRC_RC32M))

/** @defgroup  GLB_BT_BANDWIDTH_TYPE
 *  @{
 */
#define IS_GLB_BT_BANDWIDTH_TYPE(type) (((type) == GLB_BT_BANDWIDTH_1M) || \
                                        ((type) == GLB_BT_BANDWIDTH_2M))

/** @defgroup  GLB_UART_SIG_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_TYPE(type) (((type) == GLB_UART_SIG_0) || \
                                    ((type) == GLB_UART_SIG_1) || \
                                    ((type) == GLB_UART_SIG_2) || \
                                    ((type) == GLB_UART_SIG_3))

/** @defgroup  GLB_UART_SIG_FUN_TYPE
 *  @{
 */
#define IS_GLB_UART_SIG_FUN_TYPE(type) (((type) == GLB_UART_SIG_FUN_UART0_RTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_CTS) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_TXD) || \
                                        ((type) == GLB_UART_SIG_FUN_UART0_RXD))

/** @defgroup  GLB_DLL_CLK_TYPE
 *  @{
 */
#define IS_GLB_DLL_CLK_TYPE(type) (((type) == GLB_DLL_CLK_RF) ||     \
                                   ((type) == GLB_DLL_CLK_2P032M) || \
                                   ((type) == GLB_DLL_CLK_6P095M) || \
                                   ((type) == GLB_DLL_CLK_25P6M) ||  \
                                   ((type) == GLB_DLL_CLK_42P67M) || \
                                   ((type) == GLB_DLL_CLK_64M) ||    \
                                   ((type) == GLB_DLL_CLK_128M))

/** @defgroup  GLB_DLL_XTAL_TYPE
 *  @{
 */
#define IS_GLB_DLL_XTAL_TYPE(type) (((type) == GLB_DLL_XTAL_NONE) || \
                                    ((type) == GLB_DLL_XTAL_32M) ||  \
                                    ((type) == GLB_DLL_XTAL_RC32M))

/*@} end of group GLB_Public_Constants */

/** @defgroup  GLB_Public_Macros
 *  @{
 */
#define JTAG_SIG_SWAP_GPIO0_GPIO3   0x01 /* GPIO0-3   E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO4_GPIO7   0x02 /* GPIO4-7   E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO8_GPIO11  0x04 /* GPIO8-11  E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO12_GPIO15 0x08 /* GPIO12-15 E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO16_GPIO19 0x10 /* GPIO16-19 E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_GPIO20_GPIO22 0x20 /* GPIO20-22 E21_TMS/E21_TDI/E21_TCK/E21_TDO -> E21_TCK/E21_TDO/E21_TMS/E21_TDI */
#define JTAG_SIG_SWAP_NONE          0x00 /* GPIO0-22  E21_TMS/E21_TDI/E21_TCK/E21_TDO <- E21_TCK/E21_TDO/E21_TMS/E21_TDI */

#define GLB_AHB_CLOCK_CPU             (1ULL << GLB_AHB_CLOCK_IP_CPU)
#define GLB_AHB_CLOCK_SDU             (1ULL << GLB_AHB_CLOCK_IP_SDU)
#define GLB_AHB_CLOCK_SEC             (1ULL << GLB_AHB_CLOCK_IP_SEC)
#define GLB_AHB_CLOCK_DMA_0           (1ULL << GLB_AHB_CLOCK_IP_DMA_0)
#define GLB_AHB_CLOCK_DMA_1           (1ULL << GLB_AHB_CLOCK_IP_DMA_1)
#define GLB_AHB_CLOCK_DMA_2           (1ULL << GLB_AHB_CLOCK_IP_DMA_2)
#define GLB_AHB_CLOCK_CCI             (1ULL << GLB_AHB_CLOCK_IP_CCI)
#define GLB_AHB_CLOCK_RF_TOP          (1ULL << GLB_AHB_CLOCK_IP_RF_TOP)
#define GLB_AHB_CLOCK_GPIP            (1ULL << GLB_AHB_CLOCK_IP_GPIP)
#define GLB_AHB_CLOCK_TZC             (1ULL << GLB_AHB_CLOCK_IP_TZC)
#define GLB_AHB_CLOCK_EF_CTRL         (1ULL << GLB_AHB_CLOCK_IP_EF_CTRL)
#define GLB_AHB_CLOCK_SF_CTRL         (1ULL << GLB_AHB_CLOCK_IP_SF_CTRL)
#define GLB_AHB_CLOCK_EMAC            (1ULL << GLB_AHB_CLOCK_IP_EMAC)
#define GLB_AHB_CLOCK_UART0           (1ULL << GLB_AHB_CLOCK_IP_UART0)
#define GLB_AHB_CLOCK_UART1           (1ULL << GLB_AHB_CLOCK_IP_UART1)
#define GLB_AHB_CLOCK_UART2           (1ULL << GLB_AHB_CLOCK_IP_UART2)
#define GLB_AHB_CLOCK_UART3           (1ULL << GLB_AHB_CLOCK_IP_UART3)
#define GLB_AHB_CLOCK_UART4           (1ULL << GLB_AHB_CLOCK_IP_UART4)
#define GLB_AHB_CLOCK_SPI             (1ULL << GLB_AHB_CLOCK_IP_SPI)
#define GLB_AHB_CLOCK_I2C             (1ULL << GLB_AHB_CLOCK_IP_I2C)
#define GLB_AHB_CLOCK_PWM             (1ULL << GLB_AHB_CLOCK_IP_PWM)
#define GLB_AHB_CLOCK_TIMER           (1ULL << GLB_AHB_CLOCK_IP_TIMER)
#define GLB_AHB_CLOCK_IR              (1ULL << GLB_AHB_CLOCK_IP_IR)
#define GLB_AHB_CLOCK_CHECKSUM        (1ULL << GLB_AHB_CLOCK_IP_CHECKSUM)
#define GLB_AHB_CLOCK_QDEC            (1ULL << GLB_AHB_CLOCK_IP_QDEC)
#define GLB_AHB_CLOCK_KYS             (1ULL << GLB_AHB_CLOCK_IP_KYS)
#define GLB_AHB_CLOCK_I2S             (1ULL << GLB_AHB_CLOCK_IP_I2S)
#define GLB_AHB_CLOCK_USB11           (1ULL << GLB_AHB_CLOCK_IP_USB11)
#define GLB_AHB_CLOCK_CAM             (1ULL << GLB_AHB_CLOCK_IP_CAM)
#define GLB_AHB_CLOCK_MJPEG           (1ULL << GLB_AHB_CLOCK_IP_MJPEG)
#define GLB_AHB_CLOCK_BT_BLE_NORMAL   (1ULL << GLB_AHB_CLOCK_IP_BT_BLE_NORMAL)
#define GLB_AHB_CLOCK_BT_BLE_LP       (1ULL << GLB_AHB_CLOCK_IP_BT_BLE_LP)
#define GLB_AHB_CLOCK_ZB_NORMAL       (1ULL << GLB_AHB_CLOCK_IP_ZB_NORMAL)
#define GLB_AHB_CLOCK_ZB_LP           (1ULL << GLB_AHB_CLOCK_IP_ZB_LP)
#define GLB_AHB_CLOCK_WIFI_NORMAL     (1ULL << GLB_AHB_CLOCK_IP_WIFI_NORMAL)
#define GLB_AHB_CLOCK_WIFI_LP         (1ULL << GLB_AHB_CLOCK_IP_WIFI_LP)
#define GLB_AHB_CLOCK_BT_BLE_2_NORMAL (1ULL << GLB_AHB_CLOCK_IP_BT_BLE_2_NORMAL)
#define GLB_AHB_CLOCK_BT_BLE_2_LP     (1ULL << GLB_AHB_CLOCK_IP_BT_BLE_2_LP)
#define GLB_AHB_CLOCK_EMI_MISC        (1ULL << GLB_AHB_CLOCK_IP_EMI_MISC)
#define GLB_AHB_CLOCK_PSRAM0_CTRL     (1ULL << GLB_AHB_CLOCK_IP_PSRAM0_CTRL)
#define GLB_AHB_CLOCK_PSRAM1_CTRL     (1ULL << GLB_AHB_CLOCK_IP_PSRAM1_CTRL)
#define GLB_AHB_CLOCK_USB20_SDU       (1ULL << GLB_AHB_CLOCK_IP_USB20_SDU)
#define GLB_AHB_CLOCK_MIX2            (1ULL << GLB_AHB_CLOCK_IP_MIX2)
#define GLB_AHB_CLOCK_AUDIO           (1ULL << GLB_AHB_CLOCK_IP_AUDIO)
#define GLB_AHB_CLOCK_SDH             (1ULL << GLB_AHB_CLOCK_IP_SDH)
#define GLB_AHB_CLOCK_ZB_2_NORMAL     (1ULL << GLB_AHB_CLOCK_IP_ZB2_NORMAL)
#define GLB_AHB_CLOCK_ZB_2_LP         (1ULL << GLB_AHB_CLOCK_IP_ZB2_LP)
#define GLB_AHB_CLOCK_I2C1            (1ULL << GLB_AHB_CLOCK_IP_I2C1)
#define GLB_AHB_CLOCK_WIFI_PHY        (1ULL << GLB_AHB_CLOCK_IP_WIFI_PHY)
#define GLB_AHB_CLOCK_WIFI_MAC_PHY    (1ULL << GLB_AHB_CLOCK_IP_WIFI_MAC_PHY)
#define GLB_AHB_CLOCK_WIFI_PLATFORM   (1ULL << GLB_AHB_CLOCK_IP_WIFI_PLATFORM)
#define GLB_AHB_CLOCK_LZ4             (1ULL << GLB_AHB_CLOCK_IP_LZ4)
#define GLB_AHB_CLOCK_AUPDM           (1ULL << GLB_AHB_CLOCK_IP_AUPDM)
#define GLB_AHB_CLOCK_GAUGE           (1ULL << GLB_AHB_CLOCK_IP_GAUGE)
#define GLB_AHB_CLOCK_DBI             (1ULL << GLB_AHB_CLOCK_IP_DBI)
#define GLB_AHB_CLOCK_AUSOLO_TOP      (1ULL << GLB_AHB_CLOCK_IP_AUSOLO_TOP)
#define GLB_AHB_CLOCK_DMA_GPIO        (1ULL << GLB_AHB_CLOCK_IP_DMA_GPIO)
#define GLB_AHB_CLOCK_MM_MISC         (1ULL << GLB_AHB_CLOCK_IP_MM_MISC)

/*@} end of group GLB_Public_Macros */

